---
kind: property
id: P:Autodesk.Revit.DB.ScheduleSortGroupField.ShowHeader
source: html/4cdb95c4-7e2e-c76b-d2df-b7aeedcfe3ef.htm
---
# Autodesk.Revit.DB.ScheduleSortGroupField.ShowHeader Property

Indicates if a header row should be displayed before each group.

## Syntax (C#)
```csharp
public bool ShowHeader { get; set; }
```

## Remarks
The header row displays a title consisting of the value of
 the field that the schedule is grouped by.